[{"id":"addieren-von-binaerzahlen.md","title":"Addieren von Binärzahlen","speaker":"Klaus Aschenbrenner","speakerId":"klaus-aschenbrenner","room":"09.08","slot":4,"content":"\u003cp\u003eDu wolltest immer schon wissen wie eine CPU mit Binärzahlen arbeiten kann? Dann bist du in dieser Session genau richtig. Wir werden uns nämlich damit beschäftigen, wie mit einem einfachen elektronischen Schaltkreis in der Simulationssoftware \u003ca href=\"https://logic.ly\"\u003eLogicly\u003c/a\u003e 2 Binärzahlen miteinander addiert werden können. Das Addieren ist eine der elementarsten Operationen, die eine CPU ausführen kann, und auf der alle anderen Operationen aufbauen.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/addieren-von-binaerzahlen.md?ref=master"},{"id":"am-schauplatz-iot.md","title":"Am Schauplatz - IOT","speaker":"Mario Schnalzenberger","speakerId":"mario-schnalzenberger","room":"15.04","slot":2,"content":"\u003cp\u003eWie werden IoT Projekte erfolgreich realisiert? Wie können oder sollen sie konzipiert werden? Was sind dabei die Herausforderungen und Erfolgsfaktoren? Wir teilen mit Ihnen unsere Learnings aus den unterschiedlichen IoT Projekten, die wir bereits gemeinsam mit unseren Kunden umgesetzt haben.\u003c/p\u003e\n\n\u003cp\u003eBasis für nahezu all unsere IoT Projekte ist die Microsoft IoT Plattform mit zahlreichen leistungsstarken Komponenten. Wir zeigen Ihnen, welche Komponenten idealerweise wofür eingesetzt werden sollten, damit Sie von den entsprechenden Vorteilen (zB. Kosten- oder Leistungsvorteile) am meisten profitieren. Je nach Anforderung kann man zwischen zwei oder drei Alternativen „wählen“ und verändert damit die Gesamtwirkung der Aufgabe von IoT. Diese reicht vom simplen Datensammeln, -darstellen oder aber von einer integrierten Gesamtlösung. Dazu ist auch eine entsprechende Hardware nötig, denn oftmals sind Daten schon kurze Zeit nach ihrer Generierung nutzlos: Die Geschwindigkeit, mit der Daten ausgewertet und analysiert werden können, ist also wesentlich. Hier kommt Edge Computing ins Spiel. Wir zeigen Ihnen ein Praxisbeispiel anhand eines HPE Edgeline. Dies ist eine intelligente IoT-Computing-Lösung und wurde insbesondere für den Betrieb in industriellen Umgebungen entwickelt.\u003c/p\u003e\n\n\u003cp\u003eAm Ende wollen wir auch noch kurz zeigen, wohin der Weg gehen kann, damit aus IoT kombiniert mit AI (egal ob Predictive oder echte AI) auch noch ein eigenes Produkt mit umfangreicher Funktion wird.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/am-schauplatz-iot.md?ref=master"},{"id":"azure-stack-overview.md","title":"Azure Stack - Überblick und erste Erfahrungen","speaker":"Stefan Denninger","speakerId":"stefan-denninger","room":"15.05","slot":2,"content":"\u003cp\u003eAzure Stack ist die kleine Variante von Microsoft Azure für zuhause. Ein Hardware Plattform von zB HPE, Cisco, DellEMC, \u0026hellip;\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/azure-stack-overview.md?ref=master"},{"id":"chatbots-beyond-the-basics.md","title":"Chatbots – Beyond the Basics","speaker":"Igor Rončević","speakerId":"igor-roncevic","room":"E09","slot":6,"content":"\u003cp\u003eMit dem Bot Framework und den Cognitive Services stellt Microsoft mehrere Dienste für die Bot Entwicklung zur Verfügung. Als Entwickler findet man zahlreiche Beispiele für einfache Use Cases, wie z.B. das Bestellen einer Pizza. Doch wie verhält es sich, wenn man das Stadium eines „Hello World“-Beispiels verlässt? Wie strukturiert man seine Sprachmodelle, wenn die Anzahl der Intents steigt? Wie speichert man den State? Wie sorgt man für einen roten Faden in der Konversation?\u003c/p\u003e\n\n\u003cp\u003eAnhand eines realen Beispiels werden wir unsere Erfahrungen und mögliche Antworten auf diese Fragen teilen. Als Beispiel dient ein HR Chatbot, den die Firma Guid.New für Firmen wie thyssenkrupp und epunkt entwickelt hat. Er ist auf der Website eingebunden und unterstützt Jobsuchende dabei, passende Stellen zu finden, sich zu bewerben und den Bewerbungsprozess zu optimieren.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/chatbots-beyond-the-basics.md?ref=master"},{"id":"cognitive-services.md","title":"Cognitive (Easter) Services","speaker":"Roman Schacherl","speakerId":"roman-schacherl","room":"15.04","slot":3,"content":"\u003cp\u003eOstern ist gerade erst eine Woche vorbei - und Roman Schacherl zeigt in einer (nicht ganz ernst zu nehmenden) Session, wie er mit Hilfe der Cognitive Services das Osterfest AI-isiert hat. Vom Brief an den Osterhasen über Osternest-Detection bis hin zum Verwandtschafts-Detector sehen Sie die wichtigsten Cognitive Services in zahlreichen Live-Coding-Demos.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/cognitive-services.md?ref=master"},{"id":"dot-net-core-3-0-whats-new.md","title":".NET Core 3.0 - What's new?","speaker":"Christian Nagel","speakerId":"christian-nagel","room":"E09","slot":3,"content":"\u003cp\u003e.NET Core feiert 2019 schon Version 3.0. .NET Core 3.0 bringt zahlreiche Erweiterungen - dabei geht es um Erweiterungen der dotnet Tools, Änderungen in der Sprache C#, neue Features mit ASP.NET Core, als auch Entwicklung von Windows Desktop Applikationen mit .NET Core inklusive COM Interop. Christian zeigt zahlreiche dieser neuen Features inklusive Erweiterungen mit ASP.NET Core und Entity Framework Core.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/dot-net-core-3-0-whats-new.md?ref=master"},{"id":"from-power-bi-to-power-ai.md","title":"From Power BI to Power AI – Enrich your Business Intelligence with Artificial Intelligence","speaker":"Markus Ehrenmüller-Jensen","speakerId":"markus-ehrenmueller-jensen","room":"E09","slot":5,"content":"\u003cp\u003eAI is everywhere – and now even included in Power BI. Sometimes AI might be very apparent when you enrich your data with predictions by explicitly calling an Azure Machine Learning web service in Power Query. Sometimes it might by hidden in a nice little context menu when Power BI is automagically explaining the reason of a difference or a change over time in your data to you.\u003c/p\u003e\n\n\u003cp\u003eNo matter if you are a business user, analyst or data scientist – Power BI has AI capabilities tailored to you. In this session we will cover how you can integrate and leverage the use of language R, how to integrate an Azure Machine Learning Service when loading data, what kind of insights Power BI is capable of delivering automatically, how you can create a complex new column without typing a single formula/function, how you can explore your data by asking questions in plain English, \u0026hellip; and more!\u003c/p\u003e\n\n\u003cp\u003eSounds like a lot of content? I omitted most of the slides in favour to spend the time in live demos instead. Come in this session to learn how you can enrich your very own Business Intelligence with Artificial Intelligence and make the step up from Power BI to Power AI.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/from-power-bi-to-power-ai.md?ref=master"},{"id":"innovation.md","title":"KEYNOTE - Innovation","speaker":"Roland Gradl","speakerId":"roland-gradl","room":"E09","slot":1,"content":"\u003cp\u003eInnovation hat viele Namen – Digitalisierung, Industrie 4.0, AI infused, \u0026hellip; – aber am Ende bleibt es schlicht und ergreifend Innovation. Aber was macht Innovation aus? Was sind die Erfolgsfaktoren und wie vorhersehbar ist Innovation?\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/innovation.md?ref=master"},{"id":"intelligene-software-mit-office-365-und-azure.md","title":"Intelligente Software mit Office 365 und Azure erstellen (Showcase)","speaker":"Marc Pieber","speakerId":"marc-pieber stefan-dittrich","room":"10.07","slot":4,"content":"\u003cul\u003e\n\u003cli\u003eWarum Intelligente Software alles verändern wird\u003c/li\u003e\n\u003cli\u003eAI für Software Entwickler mit Office 365 und Azure\u003c/li\u003e\n\u003cli\u003eAzure kognitive Dienste: Vision und Translation Text über REST CALL angesprochen\u003c/li\u003e\n\u003cli\u003eIntegration in SharePoint mittels SPFx WebPart\u003c/li\u003e\n\u003cli\u003eSession-Beispiel: AI am Beispiel HATAHET Intelligenter Picture Resizer\u003c/li\u003e\n\u003c/ul\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/intelligene-software-mit-office-365-und-azure.md?ref=master"},{"id":"jamstack-auf-azure.md","title":"Der JAMStack auf Azure","speaker":"Stefan Baumgartner","speakerId":"stefan-baumgartner","room":"E09","slot":2,"content":"\u003cp\u003eDas \u0026ldquo;JAM\u0026rdquo; in JAMStack steht für JavaScript, APIs \u0026amp; Markup und bezeichnet eine auf Cloud Infrastrukturen ausgerichtete Architektur für Websites:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eStatische Seitengeneratoren erzeugen handgefertigtes, optimiertes Markup\u003c/li\u003e\n\u003cli\u003eDer Inhalt kommt von \u0026ldquo;Headless\u0026rdquo; Content Management Systemen, oder gar \u0026ldquo;Content as Code\u0026rdquo;\u003c/li\u003e\n\u003cli\u003eCloud Funktionen helfen uns die generierten, statischen Seiten mit dynamischer Funktionalität zu erweitern\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDa ganze garniert mit DevOps Praktiken in Form von Build Pipelines. In diesem Vortrag sehen wir uns die Vorteile und Herausforderungen von solchen Architekturen an. Wir schnappen uns Next.js, Azure Functions und Azure Pipelines und kleben die Dinge am Ende mit Marmelade aus unseren Stapeln wieder zusammen.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/jamstack-auf-azure.md?ref=master"},{"id":"lernen-statt-programmieren.md","title":"Lernen statt Programmieren - Computer lernen sehen","speaker":"Andreas Pollak","speakerId":"andreas-pollak","room":"09.08","slot":6,"content":"\u003cp\u003eWie kann ich ein Computerprogramm schreiben um Dinge auf einem Foto zu erkennen? Wie schreibe ich ein Programm welches textuelle Befehle wie: \u0026ldquo;Bestelle eine Pizza und liefere sie mir nach Hause\u0026rdquo; aufnehmen und verarbeiten kann, auch wenn der Text leicht variiert? Mit klassischer Programmierung kommen wir hier nicht wirklich weiter.\u003c/p\u003e\n\n\u003cp\u003e\u0026ldquo;Maschine Learning\u0026rdquo; kann uns helfen. In dieser Session erkläre ich auch was es mit dem Begriff \u0026ldquo;Maschine Learning\u0026rdquo; auf sich hat und zeige ich euch anhand von Beispielen, wie ihr Szenarien wie Bilderkennung,… selbst umsetzen könnt.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/lernen-statt-programmieren.md?ref=master"},{"id":"microsoft-365-governance-with-azure.md","title":"Microsoft 365 Governance with Azure","speaker":"Martina Grom, Toni Pohl","speakerId":"martina-grom toni-pohl","room":"10.07","slot":6,"content":"\u003cp\u003eDie Microsoft Cloud bietet eine Vielzahl an Diensten um Business-Szenarien abzubilden. In der realen Welt wünschen Kunden automatisierte Lösungen und Umsetzungen ihrer IT-Governance und ihrer Prozesse.\u003c/p\u003e\n\n\u003cp\u003eDieser Vortrag zeigt die Umsetzung solcher Szenarien mit Azure, wie etwa die Provisionierung neuer Teams-Arbeitsbereiche mit Workflows, Microsoft Graph und Azure Functions, custom Security-Monitoring mit Functions, Queues und Table Storage und LogicApps und Governance mit Azure und Power-BI. Governance trifft Azure – und profitiert von den vielen Services, die es ermöglichen, mit wenig Aufwand, Business Szenarien in der Cloud umzusetzen.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/microsoft-365-governance-with-azure.md?ref=master"},{"id":"microsoft-azure-open-source-technologies.md","title":"Microsoft Azure \u003c3 Open Source Technologies","speaker":"Hans-Peter Grahsl","speakerId":"hans-peter-grahsl","room":"15.04","slot":5,"content":"\u003cp\u003eÜber die letzten Jahre hat Microsoft stets aufs Neue bewiesen, welchen hohen Stellenwert Open Source Technologien insbesondere auch in unterschiedlichen Azure Cloud Computing Services eingeräumt bekommen.\u003c/p\u003e\n\n\u003cp\u003eIm Rahmen einer kurzen Einführung werden zunächst die wichtigsten Aspekte von Azure Event Hubs sowie Azure CosmosDB vorgestellt. Abseits vom Standard Betrieb liegen alternative APIs im Fokus dieser Session, welche für diese beiden Azure Services eine nahtlose Integration bzw. einen \u0026ldquo;Drop-In\u0026rdquo; Ersatz zu sehr populären Open Source Projekten ermöglichen sollen.\u003c/p\u003e\n\n\u003cp\u003eWährend Azure Event Hubs eine zu Apache Kafka kompatible API offeriert, kann Azure CosmosDB auch in einer MongoDB-kompatiblen Variante genutzt werden. Anhand einfacher Use-Cases und praktischer Live-Demos werden diese Möglichkeiten diskutiert.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/microsoft-azure-open-source-technologies.md?ref=master"},{"id":"microsoft-power-platform.md","title":"The Microsoft Power Platform - What Is It?","speaker":"Wolfgang Strasser","speakerId":"wolfgang-strasser","room":"10.07","slot":2,"content":"\u003cp\u003eThe term \u0026ldquo;Power Platform\u0026rdquo; was introduced by Satya Nadella and James Philips as the serving foundation for building powerful (cloud-baked) applications with PowerApps, Power BI and Microsoft Flow. Join me in this session to learn more about the super-powers of the Power Platform.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/microsoft-power-platform.md?ref=master"},{"id":"monitoring-solutions-with-azure-monitor.md","title":"Monitoring Solutions with Azure Monitor","speaker":"Andreas Pollak","speakerId":"andreas-pollak","room":"15.04","slot":4,"content":"\u003cp\u003eApplication Insights, Azure Monitor, Alerts, Log Analytics, VM-Monitoring-Agent,… Sagen Ihnen einige dieser Begriffe etwas, fehlt Ihnen aber der Zusammenhang? Dann sind Sie in dieser Session richtig. Hier sehen wir uns an, wie Sie ihre Anwendungen überwachen, Logs analysieren und wie Sie im Fall des Falles auf Fehler automatisiert/manuell reagieren.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/monitoring-solutions-with-azure-monitor.md?ref=master"},{"id":"office-365-backup.md","title":"Office 365, aber nicht ohne Backup!","speaker":"Rainer Fuebi","speakerId":"rainer-fuebi","room":"10.07","slot":5,"content":"\u003cul\u003e\n\u003cli\u003eWarum man vor allem auch für Office 365 ein Backup benötigt\u003c/li\u003e\n\u003cli\u003eBackup und Recovery Möglichkeiten für Office 365 am Beispiel Veeam\u003c/li\u003e\n\u003cli\u003eBackup Datenmanagement und Archivierung für Office 365\u003c/li\u003e\n\u003cli\u003eEinhaltung gesetzlicher Bestimmungen und Compliance-Vorgaben\u003c/li\u003e\n\u003cli\u003eSpecial: Office 365 und DSGVO (Was ist drin, was nicht!)\u003c/li\u003e\n\u003c/ul\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/office-365-backup.md?ref=master"},{"id":"office-365-modern-workplace-frontend-entwicklung.md","title":"Office 365 Modern Workplace FrontEnd Entwicklung (Showcase)","speaker":"Nahed Hatahet, Mathias Tauber","speakerId":"nahed-hatahet mathias-tauber","room":"10.07","slot":3,"content":"\u003cul\u003e\n\u003cli\u003eOffice 365 Modern Workplace Frontend Möglichkeiten (und Azure Backend)\u003c/li\u003e\n\u003cli\u003eFrontend Entwicklung mit Office UI Fabric und SharePoint Framework (SPFx)\u003c/li\u003e\n\u003cli\u003eSharePoint REST API (List und File API) mit TypeScript und React nutzen\u003c/li\u003e\n\u003cli\u003eCoding-Beispiele: How we build HATAHET Tiles WebPart for Office 365\u003c/li\u003e\n\u003cli\u003eIntegration von SharePoint SPFx WebParts in Microsoft Teams\u003c/li\u003e\n\u003c/ul\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/office-365-modern-workplace-frontend-entwicklung.md?ref=master"},{"id":"offline-apps-mit-xamarin.md","title":"Offline Apps mit Xamarin.Forms und EntityFramework","speaker":"Raphael Schwarz","speakerId":"raphael-schwarz","room":"15.04","slot":6,"content":"\u003cp\u003eDiese Session beschäftigt sich mit der Erstellung von online/offline fähigen mobile apps mittels Xamarin.Forms und EntityFramework Core. Die Backendlogik wird im online Modus in asp.net Core gehostet und greift auf eine SQL Azure Datenbank zu. Im offline Modus wird die gleiche Logik für den direkten Zugriff auf eine SQLite Datenbank direkt am Device verwendet.\u003c/p\u003e\n\n\u003cp\u003eIm Zentrum der Session steht die Wiederverwendbarkeit der Zugriffslogiken sowie eine synchronisations Framework auf EF Core basis für relationale Datenbanken die uns ermöglicht einen effizienten bi-direktionalen Delta-Sync zwischen der offline und online DB durchzuführen.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/offline-apps-mit-xamarin.md?ref=master"},{"id":"openid-connect-oauth-mit-azure.md","title":"From Bad to Good – OpenID Connect/OAuth mit Azure","speaker":"Anton Kalcik","speakerId":"anton-kalcik","room":"15.05","slot":6,"content":"\u003cp\u003eAls Nutzer wollte man eigentlich nur eins: endlich keine hundert verschiedene Passwörter mehr und trotzdem sichere Authentifizierung. Als Entwickler wollte man keine eigene proprietäre Authentifizierungsverfahren immer wieder aufs neue entwickeln. Genau aus diese beiden Wünschen sind OpenID Connect und OAuth, heute die wichtigste Industriestandards wenn es um Authentifizierung- und Autorisierungsprozesse geht, entstanden.\u003c/p\u003e\n\n\u003cp\u003eIn diesem Vortrag werden das Wissen um diese beiden Protokolle anhand praktischer Beispiele mit Azure vermittelt.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/openid-connect-oauth-mit-azure.md?ref=master"},{"id":"running-sql-server-2019-availability-groups-in-azure-kubernetes-services.md","title":"Running SQL Server 2019 Availability Groups in Azure Kubernetes Services","speaker":"Klaus Aschenbrenner","speakerId":"klaus-aschenbrenner","room":"15.05","slot":5,"content":"\u003cp\u003eOne of the coolest new features in SQL Server 2019 is the ability to run an Availability Group in a Kubernetes Cluster. During this demo heavy session you will see and learn how to deploy a SQL Server 2019 Availability Group into a Kubernetes Cluster that is running in Microsoft Azure.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/running-sql-server-2019-availability-groups-in-azure-kubernetes-services.md?ref=master"},{"id":"software-development-at-microsoft.md","title":"Software Development @ Microsoft","speaker":"Gerwald Oberleitner","speakerId":"gerwald-oberleitner","room":"E09","slot":4,"content":"\u003cp\u003eWie entwickelt Microsoft Azure DevOps? Mit Azure DevOps \u0026amp; Visual Studio. Die Session gibt einen Einblick in die Entwicklung dieses Service/Servers und zeigt wie die agilen Teams zusammengesetzt sind, wie die Planung \u0026amp; Abstimmung erfolgt und wie die 3-Wochen dauernden Sprints den gesamten CI/CD Prozess sowie das Testen automatisieren \u0026amp; orchestrieren.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/software-development-at-microsoft.md?ref=master"},{"id":"spieleentwicklung-in-unity.md","title":"Spieleentwicklung in Unity","speaker":"Rainer Angermann","speakerId":"rainer-angermann","room":"09.08","slot":5,"content":"\u003cp\u003eDu wolltest schon immer deine eigenen Spiele programmieren?\u003c/p\u003e\n\n\u003cp\u003eIn dieser Session zeigen wir dir wie du dein erstes Spiel in Unity entwickeln kannst. Außerdem erfährst du mehr über den gesamten Prozess der Entwicklung eines Computerspiels, die verschiedenen Rollen innerhalb eines Teams und wie diese zusammenarbeiten.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/spieleentwicklung-in-unity.md?ref=master"},{"id":"testintegration-mit-azure-devops-pipelines.md","title":"Testintegration mit Azure DevOps Pipelines - Learnings aus unseren Umsetzungsprojekten","speaker":"Michael Frank","speakerId":"michael-frank","room":"15.05","slot":4,"content":"\u003cp\u003eIn dieser Session darf ich von unseren Erfahrungen aus einem realen Umsetzungsprojekt berichten und unsere Learnings bezüglich der Integration von unterschiedlichen Testszenarien in Azure DevOps Pipelines mit euch teilen. Im Einsatz mit vor allem Selenium und REST API Testing haben wir in drei Jahren die unterschiedlichsten Fallstricke kennengelernt und Empfehlungen für die Umsetzung erarbeitet.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/testintegration-mit-azure-devops-pipelines.md?ref=master"},{"id":"torten-und-andere-diagramme.md","title":"Torten und andere Diagramme","speaker":"Markus Ehrenmüller-Jensen","speakerId":"markus-ehrenmueller-jensen","room":"09.08","slot":3,"content":"\u003cp\u003eBekannterweise “sagt ein Bild mehr als tausend Worte”. Deswegen ist es auch wichtig, sich tatsächlich “ein Bild” von Zahlen zu machen: Torten, Balken, Säulen, Linien, Portfolio, etc. stehen uns zur Auswahl. Wir werden Bekenntschaft mit dem Datasaurus machen und lernen, was Brio-Schienen mit Tortendiagrammen gemeinsam haben.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/torten-und-andere-diagramme.md?ref=master"},{"id":"wir-programmieren-einen-chatbot.md","title":"Wir programmieren einen Chatbot!","speaker":"Pia Gerhofer","speakerId":"pia-gerhofer","room":"09.08","slot":2,"content":"\u003cp\u003eDu wolltest schon immer wissen, wie man einen Chatbot programmiert?\u003c/p\u003e\n\n\u003cp\u003eMit Hilfe eines einfachen JavaScript Frameworks (BotUI) bauen wir einen kleinen eigenständigen Chatbot. Wir lernen einige Konzepte, wie man einen Chatbot schön und benutzerfreundlich gestalten kann. Außerdem werden wir dem Chatbot mit Hilfe einer JavaScript Bibliothek für Natural Language Processing lernen, bestimmte Fragen unabhängig von der Wortwahl zu erkennen.\u003c/p\u003e\n","url":"https://api.github.com/repos/coding-club-linz/global-azure-bootcamp-2019/contents/sessions/wir-programmieren-einen-chatbot.md?ref=master"}]